#include <iostream>;

using namespace std;

int main() {

    setlocale(LC_ALL, "Russian");
    int a;
    int m;
    int n;
    int x;
    int y;
    cout << "Введите число тестов" << endl;
    cin >> a;
    for (int i = 0; i < a; i++) {
        cout << "Введите высоту и ширину шахматной доски" << endl;
        cin >> n >> m;
        cout << "Введите координаты коня" << endl;
        cin >> x >> y;
        if ((x <= n) && (y <= m)) {
            int sum = 0;
            if (((x + 2) <= n) && ((y + 1) <= m) && ((x + 2) > 0) && ((y + 1) > 0)) {
                sum++;
                cout << " координаты клетки боя 1" << " : " << " X " << x + 2 << " , " << " Y " << " = " <<(y + 1) << endl;
            }
            if (((x + 1) <= n) && ((y + 2) <= m) && ((x + 1) > 0) && ((y + 2) > 0)) {
                sum++;
                cout << " координаты клетки боя 2" << " : " << " X " << x + 1 << " , " << " Y " << " = " << (y + 2) << endl;
            }
            if (((x + 2) <= n) && ((y - 1) <= m) && ((x + 2) > 0) && ((y - 1) > 0)) {
                sum++;
                cout << " координаты клетки боя 3" << " : " << " X " << x + 2 << " , " << " Y " << " = " << (y - 1) << endl;
            }
            if (((x - 2) <= n) && ((y + 1) <= m) && ((x - 2) > 0) && ((y + 1) > 0)) {
                sum++;
                cout << " координаты клетки боя 4" << " : " << " X " << x - 2 << " , " << " Y " << " = " << (y + 1) << endl;
            }
            if (((x - 2) <= n) && ((y - 1) <= m) && ((x - 2) > 0) && ((y - 1) > 0)) {
                sum++;
                cout << " координаты клетки боя 5" << " : " << " X " << x - 2 << " , " << " Y " << " = " << (y - 1) << endl;
            }
            if (((x - 1) <= n) && ((y - 2) <= m) && ((x - 1) > 0) && ((y - 2) > 0)) {
                sum++;
                cout << " координаты клетки боя 6" << " : " << " X " << x - 1 << " , " << " Y " << " = " << (y - 2) << endl;
            }
            if (((x + 1) <= n) && ((y - 2) <= m) && ((x + 1) > 0) && ((y - 2) > 0)) {
                sum++;
                cout << " координаты клетки боя 7" << " : " << " X " << x - 2 << " , " << " Y " << " = " << (y + 2) << endl;
            }
            if (((x - 1) <= n) && ((y + 2) <= m) && ((x - 1) > 0) && ((y + 2) > 0)) {
                sum++;
                cout << " координаты клетки боя 8" << " : " << " X " << x - 1 <<" , " << " Y " << " = " << (y + 2) << endl;
            }
            cout   << "кол-во клеток под боем" << " = " << sum << endl;
            cout << " " << endl;
        }
        else {
            cout << "поставь коня на доску" << endl;
        }
    }
    return 0;
}